components/camel-soap/src/test/resources/org/apache/camel/dataformat/soap/requestFault.xml

<?xml version="1.0" encoding="UTF-8" standalone="yes"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
	<soap:Body>
		<ns2:getCustomersByName xmlns:ns2="http://customerservice.example.com/">
			<name>none</name>
		</ns2:getCustomersByName>
	</soap:Body>
</soap:Envelope>