jmsServiceDestination/request.xml

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
    <soap:Body>
        <getCustomersByName xmlns="http://customerservice.example.com/">
            <name>Smith</name>
        </getCustomersByName>
    </soap:Body>
</soap:Envelope>