core/src/test/java/org/apache/cxf/feature/transform/message_utf-8_unannounced.xml

<?xml version="1.0"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
    <soap:Body>
        <cus:getCustomersByName xmlns:cus="http://customerservice.example.com/">
            <name xmlns:ns2="http://customerservice.example.com/">Lefèvre</name> <!-- Lef&egrave;vre -->
        </cus:getCustomersByName>
    </soap:Body>
</soap:Envelope>
